const azkar = [
  "🕌 *أذكار الصباح:*\n\nاللّهـمّ أنت ربـي، لا إله إلاّ أنت، خلقتنـي وأنا عبدك، وأنا على عهدك ووعدك ما استطعت، أعوذ بك من شر ما صنعت، أبوء لك بنعمتك عليّ وأبوء بذنبي، فاغفر لي فإنه لا يغفر الذنوب إلا أنت.",
  "🕌 *أذكار المساء:*\n\nرَضيـتُ بِاللهِ رَبَّاً، وبِالإسْلامِ ديـناً، وبِمُحَـمَّدٍ ﷺ نَبِيّـاً. (3 مرات)",
  "🕌 *ذكر يحبه الرحمن:*\n\nسُبْحَانَ اللَّهِ وَبِحَمْدِهِ، سُبْحَانَ اللَّهِ الْعَظِيمِ.",
  "🕌 *أعظم الذكر:*\n\nلَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ.",
  "🕌 *تحصين النفس:*\n\nبِسْمِ اللهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ. (3 مرات)",
  "🕌 *استغفار:*\n\nأستغفرُ اللهَ العظيمَ الذي لا إله إلا هو الحي القيوم وأتوبُ إليه.",
  "🕌 *كنز من كنوز الجنة:*\n\nلا حَوْلَ وَلا قُوَّةَ إِلاَّ بِاللَّه.",
  "🕌 *الصلاة على النبي ﷺ:*\n\nاللهم صلِّ وسلم وبارك على نبينا محمد وعلى آله وصحبه أجمعين.",
  "🕌 *دعاء تفريج الهم:*\n\nلا إلَهَ إلاَّ اللَّه العَظِيمُ الحلِيمُ، لا إلَهَ إلاَّ اللَّه رَبُّ العَرْشِ العَظِيمِ، لا إلَهَ إلاَّ اللَّه رَبُّ السَّمَاواتِ ورَبُّ الأَرْضِ ورَبُّ العَرْشِ الكَرِيمِ.",
  "🕌 *طلب العافية:*\n\nاللهم إنك عفو كريم تحب العفو فاعفُ عني.",
  "🕌 *دعاء ذي النون:*\n\nلَا إِلَهَ إِلَّا أَنْتَ سُبْحَانَكَ إِنِّي كُنْتُ مِنَ الظَّالِمِينَ.",
  "🕌 *الباقيات الصالحات:*\n\nسُبْحَانَ اللَّهِ، وَالْحَمْدُ لِلَّهِ، وَلَا إِلَهَ إِلَّا اللَّهُ، وَاللَّهُ أَكْبَرُ.",
  "🕌 *سيد الاستغفار:*\n\nاللهم أنت ربي لا إله إلا أنت، خلقتني وأنا عبدك، وأنا على عهدك ووعدك ما استطعت، أعوذ بك من شر ما صنعت.",
  "🕌 *دعاء الثبات:*\n\nيا مقلب القلوب ثبت قلبي على دينك.",
  "🕌 *طلب البركة:*\n\nاللهم إني أسألك علمًا نافعًا، ورزقًا طيبًا، وعملاً متقبلاً.",
  "🕌 *الاستعاذة من غلبة الدين:*\n\nاللهم إني أعوذ بك من الهم والحزن، والعجز والكسل، والبخل والجبن، وضلع الدين وغلبة الرجال."
];

let handler = async (m, { conn }) => {
    await m.react('🕌')
    const randomZikr = azkar[Math.floor(Math.random() * azkar.length)];

    let info = `${randomZikr}\n`
    info += `*‏⎔ ٠ ┈─ ━╼ • ◞🕊️◜ • ╾━ ─┈‏ ٠ ⎔*\n`
    info += `> ذكر واطمئن`

    return conn.reply(m.chat, info, fkontak, rcanal)
}

handler.help = ['اذكار']
handler.tags = ['الـديــن']
handler.command = ['اذكار', 'ذكر', 'أذكار']

export default handler
