const stories = [
      { name: "آدَم؁🫱", text: "أول البشر، خلقه الله من طين، وأسكنه الجنة، ثم نزل إلى الأرض ليبدأ منها حياة البشر 🌍" },
      { name: "إِدْرِيس؁🖋️", text: "نبيٌ حكيم، أوّل من خطّ بالقلم، ورفعه الله مكانًا عليًّا ✨" },
      { name: "نُــــوح؁🕊️️", text: "دعا قومه 950 عامًا، بنى الفلك بأمر الله ونجاه الله من الطوفان مع المؤمنين 🌊" },
      { name: "هُود؁💨", text: "أُرسل إلى قوم عاد الذين بغَوا في الأرض، فدمرهم الله بريحٍ صرصرٍ عاتية 🌪️" },
      { name: "صَالِح؁🐪", text: "أُرسل إلى ثمود، آتاهم الله الناقة آية، فعتوا وقتلوها فأهلكهم الله بالصيحة ⚡" },
      { name: "إِبْرَاهِيم؁🔥", text: "أبو الأنبياء، حطم الأصنام، وألقاه قومه في النار فجعلها الله بردًا وسلامًا 🔥" },
      { name: "لُوط؁🌪️", text: "أُرسل لقومٍ ابتدعوا الفواحش، فدمرهم الله بحجارة من سجيل 💨" },
      { name: "إِسْمَاعِيل؁🕋", text: "ابن إبراهيم، ضرب أروع مثال للطاعة في قصة الذبح، وشارك ببناء الكعبة 🕋" },
      { name: "إِسْحَاق؁🕊️", text: "ابن إبراهيم، ومن نسله جاء يعقوب وبني إسرائيل، وكان نبيًا مباركًا 📜" },
      { name: "يَعْقُوب؁🌾", text: "أبو يوسف، صبر على فراق ابنه وبشّره الله بجمع الشمل 👁️" },
      { name: "يُوسُف؁💎", text: "ألقي في البئر عبدًا، وصبر فرفعه الله حتى أصبح عزيز مصر 💖" },
      { name: "شُعَيْب؁⚖️", text: "أُرسل إلى مدين، دعا للعدل وترك التطفيف، فأهلك الله قومه بظلة 🔥" },
      { name: "أَيُّوب؁🤲", text: "ابتُلي في بدنه وماله وأهله، فصبر، فكشف الله ضره وأثابه أضعافًا 🌿" },
      { name: "ذُو الْكِفْل؁🕊️", text: "صاحب الصبر والعدل، قيل إنه لم يغضب قط وكان نبيًا صالحًا ✨" },
      { name: "مُوسَى؁📜", text: "كلمه الله، أُرسل إلى فرعون، وفلق الله له البحر ونجّى بني إسرائيل 🌊" },
      { name: "هَارُون؁🗣️", text: "أخو موسى ووزيره في الدعوة، أُعطي فصاحة وبلاغة وكان نبيًا صالحًا 💬" },
      { name: "يُونُس؁🐋", text: "ابتلعه الحوت، فسبّح في بطنه، فنجّاه الله وأرسله من جديد لقومه ✨" },
      { name: "إِلْيَاس؁🔥", text: "دعا قومه لترك عبادة صنم يُدعى (بعل)، وكان من الصابرين 💫" },
      { name: "الْيَسَع؁🕊️", text: "خلف إلياس في الدعوة، وكان نبيًا كريمًا وصالحًا مباركًا 🌿" },
      { name: "زَكَرِيَّا؁🌱", text: "دعا الله سرًا بالولد رغم كبر سنه، فوهبه الله يحيى بأمره 👶" },
      { name: "يَحْيَى؁🕊️️", text: "ولد بمعجزة، كان نبيًا زاهدًا، وتوفي شهيدًا في سبيل الحق 🩸" },
      { name: "عِيسَى؁🌿", text: "وُلِد من مريم بلا أب، أحيى الموتى بإذن الله، وبشّر بمحمد ﷺ 🌟" },
      { name: "مُحَمَّد؁ﷺ", text: "خاتم الأنبياء، أُرسل للعالمين، أخرج الناس من الظلمات إلى النور 🌍" }
];

let handler = async (m, { conn }) => {
    await m.react('💗')
    const random = stories[Math.floor(Math.random() * stories.length)];

    let info = `*˼‏💗˹ قـصـة نـبـي ↶*\n`
    info += `*‏⎔ ٠ ┈─ ━╼ • ◞🕊️◜ • ╾━ ─┈‏ ٠ ⎔*\n`
    info += `*┃╻📖╹↵ 「 ${random.name}: ${random.text} 」*\n`
    info += `*‏⎔ ٠ ┈─ ━╼ • ◞🕊️◜ • ╾━ ─┈‏ ٠ ⎔*`

    return conn.reply(m.chat, info, fkontak, rcanal)
}

handler.help = ['قصه']
handler.tags = ['الـديــن']
handler.command = ['قصه', 'قصة']

export default handler
